#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...[0m[0m
[0m[1mmodule.vpc.data.aws_elb_service_account.main: Reading...[0m[0m
[0m[1mmodule.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-027f3bd8a4b4d902d][0m
[0m[1mmodule.vpc.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...[0m[0m
[0m[1mmodule.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846][0m
[0m[1mmodule.vpc.data.aws_elb_service_account.main: Read complete after 0s [id=033677994240][0m
[0m[1mmodule.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347][0m
[0m[1mmodule.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::153808439998:policy/vpc-flow-log-to-cloudwatch-20231109112946167200000001][0m
[0m[1mmodule.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20231109112946168300000002][0m
[0m[1mmodule.vpc.data.aws_caller_identity.current: Read complete after 1s [id=153808439998][0m
[0m[1mmodule.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20231109112946168300000002-20231109112946395100000003][0m
[0m[1mmodule.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0595b11d9898ccb55][0m
[0m[1mmodule.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0479c2a804552f80c][0m
[0m[1mmodule.vpc.aws_security_group.alb_sg: Refreshing state... [id=sg-0c60d47b7b37e6d39][0m
[0m[1mmodule.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0bce6490e85bd38cc][0m
[0m[1mmodule.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c30c90e3e93f0fb4][0m
[0m[1mmodule.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d3af963426d2f955][0m
[0m[1mmodule.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-027f3bd8a4b4d902d][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b2de3d07c75eda47][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07800661de39fcaf3][0m
[0m[1mmodule.vpc.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-00547424f5ed62938][0m
[0m[1mmodule.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05c56b34a68cde464][0m
[0m[1mmodule.vpc.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-098c56d97c4004d31][0m
[0m[1mmodule.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03a8d3c70d422e453][0m
[0m[1mmodule.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00994d6e27f1791d8][0m
[0m[1mmodule.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-07ca8ee98766bffd4][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08f7941fcc683ad44][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03f020737a0a131fd][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-03d5fe78aa24fece2][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-04fa9612fc41faca6][0m
[0m[1mmodule.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07800661de39fcaf31080289494][0m
[0m[1mmodule.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dcd9f911f3325f71][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b12df987358a4ff7][0m
[0m[1mmodule.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0cf3aacc0ee19e1af][0m
[0m[1mmodule.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a4a7300a8df0b14e][0m
[0m[1mmodule.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b2de3d07c75eda471080289494][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.compute.data.aws_caller_identity.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m user_id    = (known after apply)
    }

[1m  # module.compute.data.aws_elb_service_account.main[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_elb_service_account" "main" {
      [32m+[0m[0m arn = (known after apply)
      [32m+[0m[0m id  = (known after apply)
    }

[1m  # module.compute.aws_alb_target_group.server_tg[0m will be created
[0m  [32m+[0m[0m resource "aws_alb_target_group" "server_tg" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = false
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = "rbd-server-tg"
      [32m+[0m[0m port                               = 80
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags_all                           = (known after apply)
      [32m+[0m[0m target_type                        = "ip"
      [32m+[0m[0m vpc_id                             = "vpc-027f3bd8a4b4d902d"

      [32m+[0m[0m health_check {
          [32m+[0m[0m enabled             = true
          [32m+[0m[0m healthy_threshold   = 5
          [32m+[0m[0m interval            = 30
          [32m+[0m[0m matcher             = "200"
          [32m+[0m[0m path                = "/"
          [32m+[0m[0m port                = "traffic-port"
          [32m+[0m[0m protocol            = "HTTP"
          [32m+[0m[0m timeout             = 5
          [32m+[0m[0m unhealthy_threshold = 2
        }
    }

[1m  # module.compute.aws_appautoscaling_policy.ecs_policy_cpu_server[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "ecs_policy_cpu_server" {
      [32m+[0m[0m alarm_arns         = (known after apply)
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "cpu-autoscaling"
      [32m+[0m[0m policy_type        = "TargetTrackingScaling"
      [32m+[0m[0m resource_id        = "service/rbd-ecs-cluster/rbd"
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"

      [32m+[0m[0m target_tracking_scaling_policy_configuration {
          [32m+[0m[0m disable_scale_in = false
          [32m+[0m[0m target_value     = 70

          [32m+[0m[0m predefined_metric_specification {
              [32m+[0m[0m predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

[1m  # module.compute.aws_appautoscaling_target.ecs_target_server[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_target" "ecs_target_server" {
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m max_capacity       = 1
      [32m+[0m[0m min_capacity       = 1
      [32m+[0m[0m resource_id        = "service/rbd-ecs-cluster/rbd"
      [32m+[0m[0m role_arn           = (known after apply)
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"
      [32m+[0m[0m tags_all           = (known after apply)
    }

[1m  # module.compute.aws_cloudwatch_log_group.server_lg[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "server_lg" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "rbd"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # module.compute.aws_ecs_cluster.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "main" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m name     = "rbd-ecs-cluster"
      [32m+[0m[0m tags_all = (known after apply)
    }

[1m  # module.compute.aws_ecs_cluster_capacity_providers.ecs_custer_cp[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster_capacity_providers" "ecs_custer_cp" {
      [32m+[0m[0m capacity_providers = [
          [32m+[0m[0m "FARGATE",
          [32m+[0m[0m "FARGATE_SPOT",
        ]
      [32m+[0m[0m cluster_name       = "rbd-ecs-cluster"
      [32m+[0m[0m id                 = (known after apply)
    }

[1m  # module.compute.aws_ecs_service.server[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_service" "server" {
      [32m+[0m[0m cluster                            = (known after apply)
      [32m+[0m[0m deployment_maximum_percent         = 200
      [32m+[0m[0m deployment_minimum_healthy_percent = 50
      [32m+[0m[0m desired_count                      = 1
      [32m+[0m[0m enable_ecs_managed_tags            = false
      [32m+[0m[0m enable_execute_command             = false
      [32m+[0m[0m iam_role                           = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m launch_type                        = "FARGATE"
      [32m+[0m[0m name                               = "rbd"
      [32m+[0m[0m platform_version                   = (known after apply)
      [32m+[0m[0m scheduling_strategy                = "REPLICA"
      [32m+[0m[0m tags_all                           = (known after apply)
      [32m+[0m[0m task_definition                    = (known after apply)
      [32m+[0m[0m triggers                           = (known after apply)
      [32m+[0m[0m wait_for_steady_state              = false

      [32m+[0m[0m load_balancer {
          [32m+[0m[0m container_name   = "rbd-server-container"
          [32m+[0m[0m container_port   = 80
          [32m+[0m[0m target_group_arn = (known after apply)
        }

      [32m+[0m[0m network_configuration {
          [32m+[0m[0m assign_public_ip = false
          [32m+[0m[0m security_groups  = (known after apply)
          [32m+[0m[0m subnets          = [
              [32m+[0m[0m "subnet-00994d6e27f1791d8",
              [32m+[0m[0m "subnet-05c56b34a68cde464",
            ]
        }
    }

[1m  # module.compute.aws_ecs_task_definition.server[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "server" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m arn_without_revision     = (known after apply)
      [32m+[0m[0m container_definitions    = jsonencode(
            [
              [32m+[0m[0m {
                  [32m+[0m[0m essential        = true
                  [32m+[0m[0m image            = "153808439998.dkr.ecr.us-east-2.amazonaws.com/2-rbd-server:latest"
                  [32m+[0m[0m logConfiguration = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-group         = "rbd"
                          [32m+[0m[0m awslogs-region        = "us-east-2"
                          [32m+[0m[0m awslogs-stream-prefix = "streaming"
                        }
                    }
                  [32m+[0m[0m name             = "rbd-server-container"
                  [32m+[0m[0m portMappings     = [
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPort = 80
                          [32m+[0m[0m hostPort      = 80
                          [32m+[0m[0m protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      [32m+[0m[0m cpu                      = "256"
      [32m+[0m[0m execution_role_arn       = (known after apply)
      [32m+[0m[0m family                   = "rbd-server"
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m memory                   = "512"
      [32m+[0m[0m network_mode             = "awsvpc"
      [32m+[0m[0m requires_compatibilities = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m revision                 = (known after apply)
      [32m+[0m[0m skip_destroy             = false
      [32m+[0m[0m tags_all                 = (known after apply)
      [32m+[0m[0m task_role_arn            = (known after apply)
    }

[1m  # module.compute.aws_iam_policy.ecs_task_execution_role_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "ecs_task_execution_role_policy" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "Policy that allows required access to Fargate tasks"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "rbd-task-execution_role-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "ecs:ExecuteCommand"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "VisualEditor0"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "cloudwatch:GetMetricStatistics",
                          [32m+[0m[0m "cloudwatch:ListMetrics",
                          [32m+[0m[0m "cloudwatch:PutMetricData",
                          [32m+[0m[0m "ec2:DescribeTags",
                          [32m+[0m[0m "logs:CreateLogGroup",
                          [32m+[0m[0m "logs:CreateLogStream",
                          [32m+[0m[0m "logs:DescribeLogStreams",
                          [32m+[0m[0m "logs:PutSubscriptionFilter",
                          [32m+[0m[0m "logs:PutLogEvents",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.compute.aws_iam_policy.ecs_task_role_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "ecs_task_role_policy" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "Policy that allows required access to Fargate tasks"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "rbd-task-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "ecs:ExecuteCommand"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "VisualEditor0"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "cloudwatch:GetMetricStatistics",
                          [32m+[0m[0m "cloudwatch:ListMetrics",
                          [32m+[0m[0m "cloudwatch:PutMetricData",
                          [32m+[0m[0m "ec2:DescribeTags",
                          [32m+[0m[0m "logs:CreateLogGroup",
                          [32m+[0m[0m "logs:CreateLogStream",
                          [32m+[0m[0m "logs:DescribeLogStreams",
                          [32m+[0m[0m "logs:PutSubscriptionFilter",
                          [32m+[0m[0m "logs:PutLogEvents",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.compute.aws_iam_role.ecs_task_execution_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ecs_task_execution_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = [
                              [32m+[0m[0m "ecs-tasks.amazonaws.com",
                            ]
                        }
                      [32m+[0m[0m Sid       = ""
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "rbd-task-execution-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.compute.aws_iam_role.ecs_task_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ecs_task_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ecs-tasks.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = ""
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "rbd-ecsTaskRole"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.compute.aws_iam_role_policy_attachment.ecs-task-execution-role-cloudwatch-policy-attachment[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-cloudwatch-policy-attachment" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchFullAccess"
      [32m+[0m[0m role       = "rbd-task-execution-role"
    }

[1m  # module.compute.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      [32m+[0m[0m role       = "rbd-task-execution-role"
    }

[1m  # module.compute.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment-1[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment-1" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "rbd-task-execution-role"
    }

[1m  # module.compute.aws_iam_role_policy_attachment.ecs-task-role-cloudwatch-policy-attachment[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs-task-role-cloudwatch-policy-attachment" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchFullAccess"
      [32m+[0m[0m role       = "rbd-ecsTaskRole"
    }

[1m  # module.compute.aws_iam_role_policy_attachment.ecs-task-role-policy-attachment[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs-task-role-policy-attachment" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "rbd-ecsTaskRole"
    }

[1m  # module.compute.aws_lb_listener.server_tg_route_test[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "server_tg_route_test" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags_all          = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }
    }

[1m  # module.compute.aws_security_group.ecs_service_sg[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "ecs_service_sg" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Managed by Terraform"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "10.16.0.0/16",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = true
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "rbd-ecs-service-sg"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m vpc_id                 = "vpc-027f3bd8a4b4d902d"
    }

[1m  # module.vpc.module.alb.aws_lb.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lb" "this" {
      [32m+[0m[0m arn                                         = (known after apply)
      [32m+[0m[0m arn_suffix                                  = (known after apply)
      [32m+[0m[0m desync_mitigation_mode                      = "defensive"
      [32m+[0m[0m dns_name                                    = (known after apply)
      [32m+[0m[0m drop_invalid_header_fields                  = false
      [32m+[0m[0m enable_deletion_protection                  = false
      [32m+[0m[0m enable_http2                                = true
      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers = false
      [32m+[0m[0m enable_waf_fail_open                        = false
      [32m+[0m[0m enable_xff_client_port                      = true
      [32m+[0m[0m id                                          = (known after apply)
      [32m+[0m[0m idle_timeout                                = 60
      [32m+[0m[0m internal                                    = false
      [32m+[0m[0m ip_address_type                             = "ipv4"
      [32m+[0m[0m load_balancer_type                          = "application"
      [32m+[0m[0m name                                        = "2a-alb"
      [32m+[0m[0m preserve_host_header                        = false
      [32m+[0m[0m security_groups                             = [
          [32m+[0m[0m "sg-0c60d47b7b37e6d39",
        ]
      [32m+[0m[0m subnets                                     = [
          [32m+[0m[0m "subnet-0479c2a804552f80c",
          [32m+[0m[0m "subnet-0d3af963426d2f955",
        ]
      [32m+[0m[0m tags                                        = {
          [32m+[0m[0m "Name" = "2a-alb"
        }
      [32m+[0m[0m tags_all                                    = {
          [32m+[0m[0m "Name" = "2a-alb"
        }
      [32m+[0m[0m vpc_id                                      = (known after apply)
      [32m+[0m[0m xff_header_processing_mode                  = "append"
      [32m+[0m[0m zone_id                                     = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "10m"
          [32m+[0m[0m update = "10m"
        }
    }

[1m  # module.vpc.module.vpc.aws_db_subnet_group.database[0][0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "database" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "Database subnet group for rbd"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = "rbd"
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m subnet_ids              = [
          [32m+[0m[0m "subnet-00547424f5ed62938",
          [32m+[0m[0m "subnet-098c56d97c4004d31",
        ]
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Cretaedby"   = "Terraform"
          [32m+[0m[0m "Environment" = "rbd"
          [32m+[0m[0m "Name"        = "rbd"
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Cretaedby"   = "Terraform"
          [32m+[0m[0m "Environment" = "rbd"
          [32m+[0m[0m "Name"        = "rbd"
        }
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1mPlan:[0m 21 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @harshal-kondke, Action: `pull_request`*